ka2_2024/src/Documents/СписаниеИзЭксплуатации/СписаниеИзЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеИзЭксплуатации</name>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварами</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТМЦВЭксплуатации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИнвентаризацияТМЦВЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииТМЦВЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаВнутреннееПотребление</name>
  <basedOn>Document.ИзменениеАссортимента</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВнутреннихЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ИзменениеАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <type>
        <types>CatalogRef.КатегорииЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Documents/СписаниеИзЭксплуатации/Forms/РабочееМесто/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если ОтборДата.Дата = '000101010000' Тогда
		ОтборДата.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
	КонецЕсли;
	
	Элементы.СписокПартияДатаНачалаЭксплуатации.Формат = НСтр("ru = 'ДФ=''ММММ гггг'''");
	Элементы.СписокПартияДатаЗавершенияЭксплуатации.Формат = НСтр("ru = 'ДФ=''ММММ гггг'''");
	
	УстановитьПараметрыСписка(ЭтотОбъект, ТекущаяДатаСеанса());
	
	НастроитьЗависимыеЭлементыФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СписаниеИзЭксплуатации"
		ИЛИ ИмяСобытия = "Запись_ПрочееОприходованиеТоваров"
		ИЛИ ИмяСобытия = "Запись_ЗаказНаВнутреннееПотребление" Тогда
		ОбновитьДанныеКогдаФормаСтанетАктивной();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборДатаПриИзменении(Элемент)
	
	Если ОтборДата.Дата = '000101010000' Тогда
		ОтборДата.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
	КонецЕсли;
	
	УстановитьПараметрыСписка(ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());

КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	УстановитьПараметрыСписка(ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());

КонецПроцедуры

&НаКлиенте
Процедура ОтборМОЛПриИзменении(Элемент)
	
	УстановитьПараметрыСписка(ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());

КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьПараметрыСписка(ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.СписокНоменклатура Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
		
	ИначеЕсли Поле = Элементы.СписокКатегорияЭксплуатации Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекущиеДанные.КатегорияЭксплуатации);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Списать(Команда)
	
	СоздатьСписание();

КонецПроцедуры

&НаКлиенте
Процедура Вернуть(Команда)
	
	СоздатьВозврат();

КонецПроцедуры

&НаКлиенте
Процедура Заказать(Команда)
	
	СоздатьЗаказ();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект, "СписокХарактеристика", "Список.ХарактеристикиИспользуются");
	
	ТМЦВЭксплуатацииСервер.УстановитьУсловноеОформлениеИнвентарногоНомера(
		ЭтотОбъект, "СписокИнвентарныйНомер", "Список.ИнвентарныйУчет", "Список.Партия");
	
	ТМЦВЭксплуатацииСервер.УстановитьУсловноеОформлениеФизЛица(
		ЭтотОбъект, "СписокФизическоеЛицо", "Список.УчетПоФизЛицам", "Список.Партия");
		
КонецПроцедуры

&НаСервере
Процедура НастроитьЗависимыеЭлементыФормыНаСервере()

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.СписокОрганизация.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда
		Элементы.СписокПодразделение.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		Элементы.СписокХарактеристика.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры")
		ИЛИ НЕ ТМЦВЭксплуатацииПовтИсп.ВозможенУчетСерийВЭксплуатации() Тогда
		Элементы.СписокСерия.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.СписаниеИзЭксплуатации) Тогда
		Элементы.СписокСписать.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ПрочееОприходованиеТоваров) Тогда
		Элементы.СписокВернуть.Видимость = Ложь;
	КонецЕсли;

	Если НЕ ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ЗаказНаВнутреннееПотребление) Тогда
		Элементы.СписокЗаказать.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров") Тогда
		Элементы.СписокНомерГТД.Видимость = Ложь;
		Элементы.СписокКоличествоПоРНПТ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеКогдаФормаСтанетАктивной()

	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьДанныеКогдаФормаСтанетАктивной", 0.8, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеКогдаФормаСтанетАктивной()
	
	Если ВводДоступен() Тогда
		Элементы.Список.Обновить();
	Иначе
		ОбновитьДанныеКогдаФормаСтанетАктивной();
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыСписка(Знач Форма, Знач ТекДата)

	Список = Форма.Список; // ДинамическийСписок
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", ?(Форма.ОтборДата.Дата <> '000101010000', КонецДня(Форма.ОтборДата.Дата), КонецДня(ТекДата)));
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Форма.ОтборОрганизация);
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", Форма.ОтборПодразделение);
	Список.Параметры.УстановитьЗначениеПараметра("ФизическоеЛицо", Форма.ОтборФизическоеЛицо);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписание()
	
	СписокТМЦ = Новый Массив;
	
	ТекущаяОрганизация = Неопределено;
	ТекущееПодразделение = Неопределено;

	Для Каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
		
		Если ДанныеСтроки.Организация <> ТекущаяОрганизация 
			И ТекущаяОрганизация <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ одной организации'"));
			Возврат;
		КонецЕсли;
		
		Если ДанныеСтроки.Подразделение <> ТекущееПодразделение 
			И ТекущееПодразделение <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ одного подразделения'"));
			Возврат;
		КонецЕсли;
		
		СвойстваТМЦ = Новый Структура;
		СвойстваТМЦ.Вставить("ИнвентарныйНомер", ДанныеСтроки.ИнвентарныйНомер);
		СвойстваТМЦ.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
		СвойстваТМЦ.Вставить("Характеристика", ДанныеСтроки.Характеристика);
		СвойстваТМЦ.Вставить("Серия", ДанныеСтроки.Серия);
		СвойстваТМЦ.Вставить("ФизическоеЛицо", ДанныеСтроки.ФизическоеЛицо);
		СвойстваТМЦ.Вставить("НаправлениеДеятельности", ДанныеСтроки.НаправлениеДеятельности);
		СвойстваТМЦ.Вставить("Партия", ДанныеСтроки.Партия);
		СвойстваТМЦ.Вставить("Количество", ДанныеСтроки.Количество);
		СвойстваТМЦ.Вставить("НомерГТД", ДанныеСтроки.НомерГТД);
		СвойстваТМЦ.Вставить("КоличествоПоРНПТ", ДанныеСтроки.КоличествоПоРНПТ);
		СписокТМЦ.Добавить(СвойстваТМЦ);
		
		ТекущаяОрганизация = ДанныеСтроки.Организация;
		ТекущееПодразделение = ДанныеСтроки.Подразделение;
		
	КонецЦикла;
	
	Если СписокТМЦ.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ, для которых требуется оформить списание'"));
		Возврат;
		
	КонецЕсли;
	
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("Организация", ТекущаяОрганизация);
	РеквизитыШапки.Вставить("Подразделение", ТекущееПодразделение);

	ДанныеОснования = Новый Структура;
	ДанныеОснования.Вставить("РеквизитыШапки", РеквизитыШапки);
	ДанныеОснования.Вставить("Товары", СписокТМЦ);
	
	ПараметрыФормы = Новый Структура("Основание", ДанныеОснования);
	ОткрытьФорму("Документ.СписаниеИзЭксплуатации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВозврат()
	
	СписокТМЦ = Новый Массив;
	
	ТекущаяОрганизация = Неопределено;
	ТекущееПодразделение = Неопределено;

	Для Каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
		
		Если ДанныеСтроки.Организация <> ТекущаяОрганизация 
			И ТекущаяОрганизация <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ одной организации'"));
			Возврат;
		КонецЕсли;
		
		Если ДанныеСтроки.Подразделение <> ТекущееПодразделение 
			И ТекущееПодразделение <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ одного подразделения'"));
			Возврат;
		КонецЕсли;
		
		СвойстваТМЦ = Новый Структура;
		СвойстваТМЦ.Вставить("ИнвентарныйНомер", ДанныеСтроки.ИнвентарныйНомер);
		СвойстваТМЦ.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
		СвойстваТМЦ.Вставить("Характеристика", ДанныеСтроки.Характеристика);
		СвойстваТМЦ.Вставить("Серия", ДанныеСтроки.Серия);
		СвойстваТМЦ.Вставить("ФизическоеЛицо", ДанныеСтроки.ФизическоеЛицо);
		СвойстваТМЦ.Вставить("НаправлениеДеятельности", ДанныеСтроки.НаправлениеДеятельности);
		СвойстваТМЦ.Вставить("Партия", ДанныеСтроки.Партия);
		СвойстваТМЦ.Вставить("Количество", ДанныеСтроки.Количество);
		СвойстваТМЦ.Вставить("КоличествоУпаковок", ДанныеСтроки.Количество);
		СвойстваТМЦ.Вставить("НомерГТД", ДанныеСтроки.НомерГТД);
		СвойстваТМЦ.Вставить("КоличествоПоРНПТ", ДанныеСтроки.КоличествоПоРНПТ);
		СписокТМЦ.Добавить(СвойстваТМЦ);
		
		ТекущаяОрганизация = ДанныеСтроки.Организация;
		ТекущееПодразделение = ДанныеСтроки.Подразделение;
		
	КонецЦикла;
	
	Если СписокТМЦ.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ, для которых требуется оформить возврат'"));
		Возврат;
		
	КонецЕсли;
	
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("Организация", ТекущаяОрганизация);
	РеквизитыШапки.Вставить("Подразделение", ТекущееПодразделение);
	РеквизитыШапки.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратИзЭксплуатации"));

	ДанныеОснования = Новый Структура;
	ДанныеОснования.Вставить("РеквизитыШапки", РеквизитыШапки);
	ДанныеОснования.Вставить("Товары", СписокТМЦ);
	
	ПараметрыФормы = Новый Структура("Основание", ДанныеОснования);
	ОткрытьФорму("Документ.ПрочееОприходованиеТоваров.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ()
	
	СписокТМЦ = Новый Массив;
	
	ТекущаяОрганизация = Неопределено;
	ТекущееПодразделение = Неопределено;
	ТекущееНаправлениеДеятельности = Неопределено;
	
	Для Каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
		
		Если ДанныеСтроки.Организация <> ТекущаяОрганизация 
			И ТекущаяОрганизация <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ одной организации'"));
			Возврат;
		КонецЕсли;
		
		Если ДанныеСтроки.Подразделение <> ТекущееПодразделение 
			И ТекущееПодразделение <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ одного подразделения'"));
			Возврат;
		КонецЕсли;
		
		Если ДанныеСтроки.НаправлениеДеятельности <> ТекущееНаправлениеДеятельности 
			И ТекущееНаправлениеДеятельности <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ с одним направлением деятельности'"));
			Возврат;
		КонецЕсли;
		
		СвойстваТМЦ = Новый Структура("Номенклатура,Характеристика,КатегорияЭксплуатации,ФизическоеЛицо,СтатьяРасходов,Количество,КоличествоУпаковок");
		ЗаполнитьЗначенияСвойств(СвойстваТМЦ, ДанныеСтроки);
		СвойстваТМЦ.КоличествоУпаковок = ДанныеСтроки.Количество;
		СписокТМЦ.Добавить(СвойстваТМЦ);
		
		ТекущаяОрганизация = ДанныеСтроки.Организация;
		ТекущееПодразделение = ДанныеСтроки.Подразделение;
		ТекущееНаправлениеДеятельности = ДанныеСтроки.НаправлениеДеятельности;
		
	КонецЦикла;
	
	Если СписокТМЦ.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать ТМЦ, для которых требуется оформить заказ'"));
		Возврат;
		
	КонецЕсли;
	
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("Организация", ТекущаяОрганизация);
	РеквизитыШапки.Вставить("Подразделение", ТекущееПодразделение);
	РеквизитыШапки.Вставить("НаправлениеДеятельности", ТекущееНаправлениеДеятельности);
	РеквизитыШапки.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию"));

	ДанныеОснования = Новый Структура;
	ДанныеОснования.Вставить("РеквизитыШапки", РеквизитыШапки);
	ДанныеОснования.Вставить("Товары", СписокТМЦ);
	
	ПараметрыФормы = Новый Структура("Основание", ДанныеОснования);
	ОткрытьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
